In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

def load_application_train():
    data = pd.read_csv("application_train.csv")
    return data 

def load_titanic():
    data = pd.read_csv("titanic.csv")
    return data 

df = load_titanic()
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [2]:
df["new_cabin_flag"] = np.where(df["Cabin"].isnull(),0,1)
df["new_cabin_flag_2"] = df["Cabin"].notnull().astype(int)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new_cabin_flag,new_cabin_flag_2
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0,0

In [3]:
df.groupby("new_cabin_flag").agg({"Survived":["mean","count"]})

                Survived
                    mean count
new_cabin_flag
0               0.299854   687
1               0.666667   204

In [4]:
from statsmodels.stats.proportion import proportions_ztest
stat,pvalue = proportions_ztest(count=[df.loc[df["new_cabin_flag"]==1,"Survived"].sum(),
                                       df.loc[df["new_cabin_flag"]==0,"Survived"].sum()],
                                nobs=[df.loc[df["new_cabin_flag"]==1,"Survived"].shape[0],
                                      df.loc[df["new_cabin_flag"]==0,"Survived"].shape[0]])
print(f"pval = {pvalue:.10f}")

pval = 0.0000000000

In [5]:
df.loc[(df["SibSp"]+df["Parch"])>0,"is_alone"] = 0
df.loc[(df["SibSp"]+df["Parch"])==0,"is_alone"] =1
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new_cabin_flag,new_cabin_flag_2,is_alone
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,0,0.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,1,0.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,0,1.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1,1,0.0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0,0,1.0

In [6]:
df.groupby("is_alone").agg({"Survived":["mean","count"]})

          Survived
              mean count
is_alone
0.0       0.505650   354
1.0       0.303538   537

In [7]:
stat,pvalue = proportions_ztest(count=[df.loc[df["is_alone"]==1,"Survived"].sum(),
                                       df.loc[df["is_alone"]==0,"Survived"].sum()],
                                nobs=[df.loc[df["is_alone"]==1,"Survived"].shape[0],
                                      df.loc[df["is_alone"]==0,"Survived"].shape[0]])
print(f"pval = {pvalue:.10f}")

pval = 0.0000000013

In [8]:
df.loc[df["Name"].str.contains("Mr."),"Name"]

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
5                                       Moran, Mr. James
                             ...
883                        Banfield, Mr. Frederick James
884                               Sutehall, Mr. Henry Jr
885                 Rice, Mrs. William (Margaret Norton)
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 647, dtype: object

In [9]:
df["Name"].apply(lambda x: len(x))

0      23
1      51
2      22
3      44
4      24
       ..
886    21
887    28
888    40
889    21
890    19
Name: Name, Length: 891, dtype: int64

In [10]:
df["Name"].str.len()

0      23
1      51
2      22
3      44
4      24
       ..
886    21
887    28
888    40
889    21
890    19
Name: Name, Length: 891, dtype: int64

In [11]:
df["name_count"] = df["Name"].str.len()

In [12]:
train = pd.read_csv("train.csv")
train

,PassengerId,HomePlanet,CryoSleep,Cabin,Destination,Age,VIP,RoomService,FoodCourt,ShoppingMall,Spa,VRDeck,Name,Transported
0,0001_01,Europa,False,B/0/P,TRAPPIST-1e,39.0,False,0.0,0.0,0.0,0.0,0.0,Maham Ofracculy,False
1,0002_01,Earth,False,F/0/S,TRAPPIST-1e,24.0,False,109.0,9.0,25.0,549.0,44.0,Juanna Vines,True
2,0003_01,Europa,False,A/0/S,TRAPPIST-1e,58.0,True,43.0,3576.0,0.0,6715.0,49.0,Altark Susent,False
3,0003_02,Europa,False,A/0/S,TRAPPIST-1e,33.0,False,0.0,1283.0,371.0,3329.0,193.0,Solam Susent,False
4,0004_01,Earth,False,F/1/S,TRAPPIST-1e,16.0,False,303.0,70.0,151.0,565.0,2.0,Willy Santantines,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
8688,9276_01,Europa,False,A/98/P,55 Cancri e,41.0,True,0.0,6819.0,0.0,1643.0,74.0,Gravior Noxnuther,False
8689,9278_01,Earth,True,G/1499/S,PSO J318.5-22,18.0,False,0.0,0.0,0.0,0.0,0.0,Kurta Mondalley,False
8690,9279_01,Earth,False,G/1500/S,TRAPPIST-1e,26.0,False,0.0,0.0,1872.0,1.0,0.0,Fayey Connon,True
8691,9280_01,Europa,False,E/608/S,55 Cancri e,32.0,False,0.0,1049.0,0.0,353.0,3235.0,Celeon Hontichre,False
8692,9280_02,Europa,False,E/608/S,TRAPPIST-1e,44.0,False,126.0,4688.0,0.0,0.0,12.0,Propsh Hontichre,True

In [13]:
a=train["Name"].dropna().apply(lambda x: x.split()[-1]).value_counts().to_dict()
a

{'Casonston': 18,
 'Oneiles': 16,
 'Domington': 15,
 'Litthews': 15,
 'Browlerson': 14,
 'Garnes': 14,
 'Cartez': 14,
 'Fulloydez': 14,
 'Hinglendez': 13,
 'Distured': 13,
 'Briggston': 13,
 'Barbes': 13,
 'Moodman': 13,
 'Gibbsonton': 13,
 'Vandan': 12,
 'Fowlesterez': 12,
 'Loway': 12,
 'Vloaf': 12,
 'Gainney': 12,
 'Hanner': 12,
 'Georgasey': 12,
 'Wagnerray': 11,
 'Cofferson': 11,
 'Jenson': 11,
 'Gouldensen': 11,
 'Morelly': 11,
 'Fryersonis': 11,
 'Ingston': 11,
 'Mosteraked': 11,
 'Torrez': 11,
 'Buckentry': 11,
 'Chanan': 11,
 'Crité': 11,
 'Pirejus': 11,
 'Villenson': 11,
 'Ousious': 11,
 'Clugete': 11,
 'Kiling': 11,
 'Ainserfle': 11,
 'Coolerson': 11,
 'Fla': 11,
 'Clemondsey': 11,
 'Belley': 11,
 'Yorkland': 11,
 'Guerson': 11,
 'Willy': 11,
 'Haydenzier': 10,
 'Mclardson': 10,
 'Wilsoney': 10,
 'Minen': 10,
 'Navages': 10,
 'Wartyson': 10,
 'Sageng': 10,
 'Sysilstict': 10,
 'Josey': 10,
 'Braymon': 10,
 'Rilley': 10,
 'Fone': 10,
 'Pread': 10,
 'Birt': 10,
 'Gainebergan': 10,
 'Santry': 10,
 'Woody': 10,
 'Lopelases': 10,
 'Moodsey': 10,
 'Pittler': 10,
 'Serry': 10,
 'Mckinsond': 10,
 'Booneid': 10,
 'Tranciams': 10,
 'Meake': 10,
 'Vincenton': 10,
 'Dal': 10,
 'Powery': 10,
 'Cardner': 10,
 'Openduave': 10,
 'Potters': 9,
 'Platch': 9,
 'Castannison': 9,
 'Lowelliott': 9,
 'Ewiseston': 9,
 'Quart': 9,
 'Flemaney': 9,
 'Hubbarrison': 9,
 'Pollarkeeks': 9,
 'Webstephrey': 9,
 'Boltund': 9,
 'Jacostaney': 9,
 'Willangsey': 9,
 'Monroellynn': 9,
 'Drakeekss': 9,
 'Bine': 9,
 'Bonnondry': 9,
 'Sancasey': 9,
 'Matts': 9,
 'Adavisons': 9,
 'Rigginsen': 9,
 'Mayods': 9,
 'Mille': 9,
 'Beckeey': 9,
 'Bardinard': 9,
 'Reedall': 9,
 'Vinozarks': 9,
 'Wolffy': 9,
 'Burchrison': 9,
 'Wardendez': 9,
 'Waltonnedy': 9,
 'Foxter': 9,
 'Hoppers': 9,
 'Myling': 9,
 'Unkcatted': 9,
 'Bookerson': 8,
 'Mcbriddley': 8,
 'Tersimpson': 8,
 'Nichoan': 8,
 'Flell': 8,
 'Chavezalez': 8,
 'Make': 8,
 'Wolfaddox': 8,
 'Thorney': 8,
 'Gene': 8,
 'Lynnerett': 8,
 'Ellahan': 8,
 'Bradlerson': 8,
 'Briggins': 8,
 'Joycerton': 8,
 'Kramosley': 8,
 'Wolferguson': 8,
 'Ineedeve': 8,
 'Invebodene': 8,
 'Woodwinez': 8,
 'Gallard': 8,
 'Jamai': 8,
 'Fryan': 8,
 'Wolfernan': 8,
 'Bate': 8,
 'Hednigic': 8,
 'Spandisket': 8,
 'Listive': 8,
 'Hapie': 8,
 'Patthews': 8,
 'Hurchez': 8,
 'Prefule': 8,
 'Hubbarton': 8,
 'Terry': 8,
 'Bartines': 8,
 'Cardners': 8,
 'Gilleyons': 8,
 'Waring': 8,
 'Nan': 8,
 'Warrishales': 8,
 'Cartyernan': 8,
 'Toddleton': 8,
 'Rocknight': 8,
 'Hestes': 8,
 'Flowensley': 8,
 'Handertiz': 8,
 'Ble': 8,
 'Emead': 8,
 'Mckinn': 8,
 'Weavesend': 8,
 'Carpennels': 8,
 'Stannondez': 8,
 'Steinardson': 8,
 'Ramad': 8,
 'Pepie': 8,
 'Scoudelle': 8,
 'Apie': 8,
 'Roses': 8,
 'Sweett': 8,
 'Cartz': 8,
 'Pimne': 8,
 'Unteckery': 8,
 'Mirezavis': 8,
 'Dedometeel': 8,
 'Shieldson': 8,
 'Reke': 8,
 'Wellierras': 8,
 'Brightez': 8,
 'Wirdley': 7,
 'Bakerson': 7,
 'Savaraldez': 7,
 'Folhal': 7,
 'Hodes': 7,
 'Preeldy': 7,
 'Maynardner': 7,
 'Sullones': 7,
 'Blancoy': 7,
 'Merce': 7,
 'Cartiz': 7,
 'Shricatory': 7,
 'Alvasquez': 7,
 'Jorden': 7,
 'Ellson': 7,
 'Batestonley': 7,
 'Lambleyoun': 7,
 'Jacostaffey': 7,
 'Pentss': 7,
 'Strongers': 7,
 'Schwardson': 7,
 'Wate': 7,
 'Cre': 7,
 'Meyersones': 7,
 'Benney': 7,
 'Hahnstonsen': 7,
 'Franton': 7,
 'Flité': 7,
 'Sawyerson': 7,
 'Oconley': 7,
 'Yanton': 7,
 'Quinnerettt': 7,
 'Hinetthews': 7,
 'Disivering': 7,
 'Katte': 7,
 'Curle': 7,
 'Simpsonks': 7,
 'Polliamposs': 7,
 'Gallenry': 7,
 'Frasp': 7,
 'Cleachrand': 7,
 'Flate': 7,
 'Prity': 7,
 'Daughttley': 7,
 'Rapie': 7,
 'Wassird': 7,
 'Sextones': 7,
 'Inghtal': 7,
 'Deckerson': 7,
 'Traverdy': 7,
 'Mcinton': 7,
 'Conie': 7,
 'Grean': 7,
 'Gordanieves': 7,
 'Currisones': 7,
 'Knik': 7,
 'Swanardy': 7,
 'Reeddommy': 7,
 'Whitez': 7,
 'Blacks': 7,
 'Hewson': 7,
 'Puckenton': 7,
 'Mcphernard': 7,
 'Wheelez': 7,
 'Folumorly': 7,
 'Foraud': 7,
 'Leonzaley': 7,
 'Anthompson': 7,
 'Harverez': 7,
 'Kerristicey': 7,
 'Rodger': 7,
 'Pine': 7,
 'Tepie': 7,
 'Wala': 7,
 'Solon': 7,
 'Plegred': 7,
 'Douglasen': 7,
 'Scerodbox': 7,
 'Arible': 7,
 'Alldson': 7,
 'Pota': 7,
 'Hughriend': 7,
 'Alaring': 7,
 'Llobsoney': 7,
 'Cooperkins': 7,
 'Farleyatton': 7,
 'Merkins': 7,
 'Sprender': 7,
 'Buche': 7,
 'Beachez': 7,
 'Kimons': 7,
 'Santin': 7,
 'Excialing': 7,
 'Balderts': 7,
 'Pooles': 7,
 'Stephendsey': 7,
 'Valezaley': 7,
 'Bartez': 7,
 'Hammonton': 7,
 'Welles': 7,
 'Lunapperts': 7,
 'Cookson': 7,
 'Thony': 7,
 'Dratembid': 7,
 'Reenez': 7,
 'Cochrisons': 7,
 'Prestonard': 7,
 'Mccarveymon': 7,
 'Brenney': 7,
 'Garden': 7,
 'Brantuarez': 7,
 'Carpentley': 7,
 'River': 7,
 'Waderoachez': 7,
 'Sweekstarks': 7,
 'Coweboded': 7,
 'Carrishley': 7,
 'Sellahaney': 7,
 'Potte': 7,
 'Dicksons': 6,
 'Crakete': 6,
 'Trankliney': 6,
 'Bun': 6,
 'Munozanson': 6,
 'Dickley': 6,
 'Reming': 6,
 'Klindsey': 6,
 'Pittson': 6,
 'Scottuez': 6,
 'Loverthyo': 6,
 'Simstravery': 6,
 'Shbre': 6,
 'Purle': 6,
 'Honatte': 6,
 'Rodricker': 6,
 'Dightent': 6,
 'Fitzgerson': 6,
 'Swingse': 6,
 'Morrencis': 6,
 'Ennalve': 6,
 'Kashe': 6,
 'Hinesh': 6,
 'Steeletters': 6,
 'Hoodgers': 6,
 'Cleang': 6,
 'Ropie': 6,
 'Ambleetive': 6,
 'Wolferton': 6,
 'Herreras': 6,
 'Erle': 6,
 'Anpie': 6,
 'Malliamsey': 6,
 'Delazarson': 6,
 'Hamcmahon': 6,
 'Kra': 6,
 'Hontichre': 6,
 'Clumshangs': 6,
 'Paie': 6,
 'Covetive': 6,
 'Nutte': 6,
 'Lerez': 6,
 'Gordond': 6,
 'Jarvey': 6,
 'Gallencis': 6,
 'Saley': 6,
 'Alfordonard': 6,
 'Dillips': 6,
 'Williotters': 6,
 'Cla': 6,
 'Winie': 6,
 'Carreralend': 6,
 'Brathful': 6,
 'Bakericks': 6,
 'Fisty': 6,
 'Simson': 6,
 'Hetforhaft': 6,
 'Hurles': 6,
 'Berle': 6,
 'Sfin': 6,
 'Mclarseney': 6,
 'Lambles': 6,
 'Holcompson': 6,
 'Callowery': 6,
 'Weaves': 6,
 'Shephendry': 6,
 'Mcgoway': 6,
 'Frattyring': 6,
 'Bane': 6,
 'Leste': 6,
 'Peterstarks': 6,
 'Webstenson': 6,
 'Sykess': 6,
 'Trerady': 6,
 'Hortis': 6,
 'Cattyried': 6,
 'Bakerrison': 6,
 'Bootez': 6,
 'Brakeng': 6,
 'Hersons': 6,
 'Stpie': 6,
 'Snoff': 6,
 'Kirks': 6,
 'Cleminglas': 6,
 'Mejiaddox': 6,
 'Must': 6,
 'Mcneiley': 6,
 'Ametic': 6,
 'Susent': 6,
 'Santantines': 6,
 'Brele': 6,
 'Woodwardy': 6,
 'Bau': 6,
 'Witeronfus': 6,
 'Brighttt': 6,
 'Mcfaddennon': 6,
 'Spien': 6,
 'Prie': 6,
 'Cone': 6,
 'Arner': 6,
 'Nacke': 6,
 'Coopelandez': 6,
 'Johnshines': 6,
 'Ses': 6,
 'Tractive': 6,
 'Nolds': 6,
 'Greeves': 6,
 'Leeves': 6,
 'Owerson': 6,
 'Raste': 6,
 'Mclainez': 6,
 'Belstrut': 6,
 'Kart': 6,
 'Whitledges': 6,
 'Merte': 6,
 'Summington': 6,
 'Hayder': 6,
 'Fielson': 6,
 'Brity': 6,
 'Byerry': 6,
 'Chocaters': 6,
 'Haynard': 6,
 'Kellyons': 6,
 'Mcdanield': 6,
 'Knike': 6,
 'Diateous': 6,
 'Hurchanney': 6,
 'Goffey': 6,
 'Hoppernardy': 6,
 'Baldson': 6,
 'Bushallert': 6,
 'Dicely': 6,
 'Alberts': 6,
 'Sinda': 6,
 'Hahnstoneal': 6,
 'Patrichane': 6,
 'Peckerson': 6,
 'Mallerez': 6,
 'Hopez': 6,
 'Carlsonney': 6,
 'Sturt': 6,
 'Horndley': 6,
 'Unpasine': 6,
 'Englence': 6,
 'Alenter': 6,
 'Hornettoney': 6,
 'Stité': 6,
 'Alentonway': 6,
 'Stike': 6,
 'Nalanet': 6,
 'Ballocks': 6,
 'Roachoanand': 6,
 'Welte': 6,
 'Mirez': 6,
 'Gocent': 6,
 'Johnsby': 6,
 'Spencervan': 6,
 'Sterreray': 6,
 'Sorbitter': 6,
 'Chman': 6,
 'Horte': 6,
 'Boyers': 6,
 'Barnolaney': 6,
 'Emenez': 6,
 'Connon': 6,
 'Teake': 6,
 'Suasharic': 6,
 'Moodson': 6,
 'Peter': 6,
 'Coolez': 6,
 'Homin': 6,
 'Moreman': 6,
 'Hickett': 6,
 'Opshaft': 5,
 'Pare': 5,
 'Fielsenders': 5,
 'Healted': 5,
 'Gardsondez': 5,
 'Scotterkins': 5,
 'Drelcate': 5,
 'Sempreate': 5,
 'Praded': 5,
 'Dishocatal': 5,
 'Reenon': 5,
 'Cako': 5,
 'Mele': 5,
 'Schmondez': 5,
 'Gilleranks': 5,
 'Corman': 5,
 'Secont': 5,
 'Ingwhed': 5,
 'Pughanders': 5,
 'Logannon': 5,
 'Chsere': 5,
 'Sofraten': 5,
 'Hayerson': 5,
 'Cuche': 5,
 'Dister': 5,
 'Popelazquez': 5,
 'Lansuffle': 5,
 'Ancy': 5,
 'Kramorry': 5,
 'Watkinsley': 5,
 'Rivanseney': 5,
 'Subateful': 5,
 'Chapmaney': 5,
 'Berreranks': 5,
 'Aroodint': 5,
 'Prearright': 5,
 'Cousel': 5,
 'Palmes': 5,
 'Craleve': 5,
 'Prickmantes': 5,
 'Cusa': 5,
 'Praugnox': 5,
 'Harry': 5,
 'Blane': 5,
 'Disgul': 5,
 'Gaineyerson': 5,
 'Charpelaney': 5,
 'Conney': 5,
 'Fishopper': 5,
 'Stpingepid': 5,
 'Barrelliver': 5,
 'Queke': 5,
 'Daviddley': 5,
 'Clake': 5,
 'Roachez': 5,
 'Sometery': 5,
 'Nasquez': 5,
 'Scake': 5,
 'Bardina': 5,
 'Perie': 5,
 'Boltond': 5,
 'Barnoldeney': 5,
 'Beckeetter': 5,
 'Fordulgaug': 5,
 'Hendrys': 5,
 'Estiagosen': 5,
 'Whiters': 5,
 'Sidie': 5,
 'Morgerson': 5,
 'Colensid': 5,
 'Bucknersony': 5,
 'Reyersendry': 5,
 'Pre': 5,
 'Burnewman': 5,
 'Emetillove': 5,
 'Simous': 5,
 'Bryants': 5,
 'Dianket': 5,
 'Lacke': 5,
 'Farmonrada': 5,
 'Sellentry': 5,
 'Fache': 5,
 'Olivasquez': 5,
 'Boderbint': 5,
 'Gin': 5,
 'Whealeed': 5,
 'Swin': 5,
 'Jeffey': 5,
 'Pernised': 5,
 'Purte': 5,
 'Derry': 5,
 'Manie': 5,
 'Chité': 5,
 'Balley': 5,
 'Hanghanson': 5,
 'Slable': 5,
 'Cres': 5,
 'Fralledic': 5,
 'Midtt': 5,
 'Hacle': 5,
 'Tronsive': 5,
 'Waterson': 5,
 'Loverceson': 5,
 'Bucklandez': 5,
 'Pulgaly': 5,
 'Castron': 5,
 'Fultz': 5,
 'Bruthydre': 5,
 'Puckley': 5,
 'Chanash': 5,
 'Bradamss': 5,
 'Meleon': 5,
 'Gloother': 5,
 'Lewintos': 5,
 'Chate': 5,
 'Cainghannon': 5,
 'Hickson': 5,
 'Mcfarley': 5,
 'Garnettiz': 5,
 'Hermanapp': 5,
 'Sache': 5,
 'Casez': 5,
 'Ricks': 5,
 'Guezaley': 5,
 'Knoxonway': 5,
 'Parsoney': 5,
 'Dillestron': 5,
 'Sterson': 5,
 'Fisheparks': 5,
 'Thonyderson': 5,
 'Che': 5,
 'Garrincent': 5,
 'Pager': 5,
 'Buckleinson': 5,
 'Simmonders': 5,
 'Mirandry': 5,
 'Prin': 5,
 'Stioutody': 5,
 'Poperez': 5,
 'Pacerty': 5,
 'Gread': 5,
 'Bellarkerd': 5,
 'Butte': 5,
 'Bache': 5,
 'Chpie': 5,
 'Grahangory': 5,
 'Fueling': 5,
 'Reelest': 5,
 'Leodger': 5,
 'Deeke': 5,
 'Chuble': 5,
 'Presstic': 5,
 'Moongton': 5,
 'Frazie': 5,
 'Sloweber': 5,
 'Russon': 5,
 'Coning': 5,
 'Alcemblery': 5,
 'Pead': 5,
 'Barris': 5,
 'Saf': 5,
 'Mare': 5,
 'Fiha': 5,
 'Gealloyalt': 5,
 'Kinson': 5,
 'Carterson': 5,
 'Holatirint': 5,
 'Gaington': 5,
 'Estron': 5,
 'Dayers': 5,
 'Portananney': 5,
 'Kraie': 5,
 'Burchanez': 5,
 'Objeciane': 5,
 'Carté': 5,
 'Voliat': 5,
 'Fowles': 5,
 'Pressive': 5,
 'Traie': 5,
 'Netshaless': 5,
 'Geraing': 5,
 'Hamberterry': 5,
 'Floydendley': 5,
 'Berges': 5,
 'Hurchrisong': 5,
 'Robins': 5,
 'Tité': 5,
 'Ches': 5,
 'Quelfly': 5,
 'Mallisly': 5,
 'Rhuba': 5,
 'Powenoble': 5,
 'Mayson': 5,
 'Simsey': 5,
 'Camerrison': 5,
 'Warrison': 5,
 'Diouselt': 5,
 'Campson': 5,
 'Coopezmaney': 5,
 'Start': 5,
 'Buchansen': 5,
 'Bake': 5,
 'Valexandez': 5,
 'Pottonalden': 5,
 'Plattering': 5,
 'Mormonized': 5,
 'Dutte': 5,
 'Contrevins': 5,
 'Unhearfus': 5,
 'Matoltuble': 5,
 'Kiddley': 5,
 'Empie': 5,
 'Prinson': 5,
 'Baketton': 5,
 'Carvis': 5,
 'Griffince': 5,
 'Dinsprody': 5,
 'Casty': 5,
 'Suptibler': 5,
 'Blandez': 5,
 'Busive': 5,
 'Miltongson': 5,
 'Lewinez': 5,
 'Cooks': 5,
 'Norrison': 5,
 'Min': 5,
 'Panie': 5,
 'Figuez': 5,
 'Wiggs': 5,
 'Supred': 5,
 'Deva': 5,
 'Perte': 5,
 'Mccarry': 5,
 'Coxterez': 5,
 'Sad': 5,
 'Pette': 5,
 'Thomason': 5,
 'Beckerson': 5,
 'Beston': 5,
 'Chaellerty': 5,
 'Potterry': 5,
 'Brine': 5,
 'Fuelisent': 5,
 'Solinez': 5,
 'Mcguirez': 5,
 'Flynner': 5,
 'Carezquez': 5,
 'Blanglison': 5,
 'Stersetery': 5,
 'Morrows': 5,
 'Potie': 5,
 'Wilderssen': 5,
 'Avisnydes': 5,
 'Aloubtled': 5,
 'Blan': 5,
 'Hoorherve': 5,
 'Fringh': 4,
 'Nateansive': 4,
 'Mullericer': 4,
 'Part': 4,
 'Scottney': 4,
 'Mcbriggins': 4,
 'Mcfaddoxter': 4,
 'Retefule': 4,
 'Hebernandry': 4,
 'Tirt': 4,
 'Morez': 4,
 'Cheen': 4,
 'Fanseld': 4,
 'Nutca': 4,
 'Armstromez': 4,
 'Gilesonston': 4,
 'Patteraley': 4,
 'Dyers': 4,
 'Reste': 4,
 'Rekle': 4,
 'Bulliamoses': 4,
 'Sparsaxle': 4,
 'Reyervaney': 4,
 'Hotte': 4,
 'Whifounrew': 4,
 'Curton': 4,
 'Rotter': 4,
 'Micknightt': 4,
 'Popelacruz': 4,
 'Cardsay': 4,
 'Vantonson': 4,
 'Holliams': 4,
 'Pringrous': 4,
 'Fushausive': 4,
 'Brailidy': 4,
 'Barkeretton': 4,
 'Jenkinnedy': 4,
 'Taptiritty': 4,
 'Spedlybood': 4,
 'Giba': 4,
 'Jaff': 4,
 'Heeroling': 4,
 'Talls': 4,
 'Leonaldez': 4,
 'Daughessey': 4,
 'Paulllegory': 4,
 'Mity': 4,
 'Stewder': 4,
 'Staf': 4,
 'Motled': 4,
 'Pierry': 4,
 'Dischod': 4,
 'Prité': 4,
 'Sesa': 4,
 'Floaf': 4,
 'Yatters': 4,
 'Berte': 4,
 'Dickman': 4,
 'Sancockett': 4,
 'Vandez': 4,
 'Jimes': 4,
 'Kité': 4,
 'Nieldsond': 4,
 'Barrilloney': 4,
 'Mander': 4,
 'Bootty': 4,
 'Floways': 4,
 'Pearsalason': 4,
 'Kellynn': 4,
 'Gardonadox': 4,
 'Gregordy': 4,
 'Mcmahoney': 4,
 'Veriedeezy': 4,
 'Harmontry': 4,
 'Leblanchez': 4,
 'Mosepherry': 4,
 'Graie': 4,
 'Dissper': 4,
 'Harley': 4,
 'Iniouser': 4,
 'Bacistion': 4,
 'Corie': 4,
 'Philliames': 4,
 'Grifford': 4,
 'Newtontoss': 4,
 'Beasleyes': 4,
 'Hake': 4,
 'Johnsondez': 4,
 'Workmans': 4,
 'Perty': 4,
 'Gele': 4,
 'Haynardy': 4,
 'Nate': 4,
 'Singtons': 4,
 'Hardonald': 4,
 'Contery': 4,
 'Moorez': 4,
 'Ingent': 4,
 'Headardyer': 4,
 'Mane': 4,
 'Pretive': 4,
 'Assibler': 4,
 'Hickley': 4,
 'Wonglasquez': 4,
 'Whitakers': 4,
 'Mcleaney': 4,
 'Popez': 4,
 'Poustive': 4,
 'Ewisentley': 4,
 'Kirklander': 4,
 'Pooley': 4,
 'Mcfaddenson': 4,
 'Khaf': 4,
 'Reynoldez': 4,
 'Mirinanty': 4,
 'Baleful': 4,
 'Gambs': 4,
 'Mepie': 4,
 'Griffy': 4,
 'Porté': 4,
 'Hoffergess': 4,
 'Vines': 4,
 'Perle': 4,
 'Hutchinton': 4,
 'Ste': 4,
 'Goldendrice': 4,
 'Walterson': 4,
 'Freevenson': 4,
 'Deckley': 4,
 'Coudered': 4,
 'Hobbinson': 4,
 'Droning': 4,
 'Fowlaney': 4,
 'Ryanga': 4,
 'Bushins': 4,
 'Blange': 4,
 'Edwartizman': 4,
 'Ocherman': 4,
 'Burchard': 4,
 'Hendrewsons': 4,
 'Prieress': 4,
 'Philloway': 4,
 'Gloyanthy': 4,
 'Holson': 4,
 'Joyneidez': 4,
 'Horners': 4,
 'Namsheary': 4,
 'Morrodgers': 4,
 'Morsentley': 4,
 'Llovers': 4,
 'Carsoning': 4,
 'Sweene': 4,
 'Geneltic': 4,
 'Bancy': 4,
 'Vales': 4,
 'Crayeson': 4,
 'Purellliss': 4,
 'Foledges': 4,
 'Weissey': 4,
 'Doughan': 4,
 'Porki': 4,
 'Nutty': 4,
 'Benderez': 4,
 'Irwines': 4,
 'Wasterivel': 4,
 'Brin': 4,
 'Cassiding': 4,
 'Datie': 4,
 'Hoopez': 4,
 'Calazy': 4,
 'Stanleyd': 4,
 'Gine': 4,
 'Crueld': 4,
 'Alshipson': 4,
 'Frolestty': 4,
 'Parbage': 4,
 'Gelte': 4,
 'Gamberson': 4,
 'Masquez': 4,
 'Stingive': 4,
 'Hayertez': 4,
 'Sweeton': 4,
 'Gulcepusy': 4,
 'Chmad': 4,
 'Diabysid': 4,
 'Jacostarks': 4,
 'Bardson': 4,
 'Clinarfork': 4,
 'Cruzaley': 4,
 'Pane': 4,
 'Brakepined': 4,
 'Krake': 4,
 'Sin': 4,
 'Blate': 4,
 'Bertsontry': 4,
 'Emone': 4,
 'Seen': 4,
 'Dan': 4,
 'Humphreyes': 4,
 'Olshaffey': 4,
 'Perable': 4,
 'Pottney': 4,
 'Sweenez': 4,
 'Shpie': 4,
 'Woodwinton': 4,
 'Meteet': 4,
 'Spistory': 4,
 'Barne': 4,
 'Antoshipson': 4,
 'Nichaner': 4,
 'Braned': 4,
 'Pughlinsons': 4,
 'Garzaley': 4,
 'Saundez': 4,
 'Bradiary': 4,
 'Kidne': 4,
 'Acobson': 4,
 'Tionstious': 4,
 'Mathison': 4,
 'Kellson': 4,
 'Heermy': 4,
 'Radisiouss': 4,
 'Apenelexy': 4,
 'Burraymons': 4,
 'Hessey': 4,
 'Ingascomet': 4,
 'Vinston': 4,
 'Sueke': 4,
 'Perta': 4,
 'Facke': 4,
 'Stiviorad': 4,
 'Stroyledgez': 4,
 'Patoetic': 4,
 'Pugherman': 4,
 'Flynnis': 4,
 'Fawnsive': 4,
 'Weaverays': 4,
 'Flé': 4,
 'Idercaling': 4,
 'Mayder': 4,
 'Hickerson': 4,
 'Mone': 4,
 'Dunnisey': 4,
 'Munozaley': 4,
 'Creke': 4,
 'Mcdowns': 4,
 'Boyersons': 4,
 'Pasharne': 4,
 'Spoilling': 4,
 'Scheron': 4,
 'Burksson': 4,
 'Fictful': 4,
 'Slavested': 4,
 'Pert': 4,
 'Bealvewd': 4,
 'Volloor': 4,
 'Wooterston': 4,
 'Paynard': 4,
 'Vertfull': 4,
 'Trattle': 4,
 'Admingried': 4,
 'Keithunts': 4,
 'Paska': 4,
 'Maxled': 4,
 'Modent': 4,
 'Betie': 4,
 'Rames': 4,
 'Ricews': 4,
 'Tuckers': 4,
 'Folemonley': 4,
 'Kennetty': 4,
 'Conable': 4,
 'Sau': 4,
 ...}

In [16]:
train["Name"].dropna().apply(lambda x: x.split()[-1]).map(a)

0       1
1       4
2       6
3       6
4       6
       ..
8688    3
8689    2
8690    6
8691    6
8692    6
Name: Name, Length: 8493, dtype: int64

In [15]:
df["name_word_count"] = df["Name"].apply(lambda x: len(str(x).split()))
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new_cabin_flag,new_cabin_flag_2,is_alone,name_count,name_word_count
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,0,0.0,23,4
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,1,0.0,51,7
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,0,1.0,22,3
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1,1,0.0,44,7
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0,0,1.0,24,4

In [16]:
len(["a","b","c"])

3

In [17]:
df["Name"].apply(lambda x: "".join([y for y in x.split() if y.startswith("Mr.")]))

0      Mr.
1
2
3
4      Mr.
      ...
886
887
888
889    Mr.
890    Mr.
Name: Name, Length: 891, dtype: object

In [18]:
df["name_dr"] =df["Name"].apply(lambda x:len([y for y in x.split() if y.startswith("Dr.")]))
df["name_dr"].value_counts()

name_dr
0    884
1      7
Name: count, dtype: int64

In [19]:
df["Name"].str.extract(" ([A-Za-z]+)\.",expand=False)

0        Mr
1       Mrs
2      Miss
3       Mrs
4        Mr
       ...
886     Rev
887    Miss
888    Miss
889      Mr
890      Mr
Name: Name, Length: 891, dtype: object

In [20]:
df["new_title"] =df["Name"].str.extract(" ([A-Za-z]+)\.",expand=False)
df.groupby("new_title").agg({"Survived":["mean","count"]})

           Survived
               mean count
new_title
Capt       0.000000     1
Col        0.500000     2
Countess   1.000000     1
Don        0.000000     1
Dr         0.428571     7
Jonkheer   0.000000     1
Lady       1.000000     1
Major      0.500000     2
Master     0.575000    40
Miss       0.697802   182
Mlle       1.000000     2
Mme        1.000000     1
Mr         0.156673   517
Mrs        0.792000   125
Ms         1.000000     1
Rev        0.000000     6
Sir        1.000000     1

In [21]:
df["new_title"].isnull().sum()

0

In [22]:
df.groupby("new_title").agg({"Age":["mean","count"]})

                 Age
                mean count
new_title
Capt       70.000000     1
Col        58.000000     2
Countess   33.000000     1
Don        40.000000     1
Dr         42.000000     6
Jonkheer   38.000000     1
Lady       48.000000     1
Major      48.500000     2
Master      4.574167    36
Miss       21.773973   146
Mlle       24.000000     2
Mme        24.000000     1
Mr         32.368090   398
Mrs        35.898148   108
Ms         28.000000     1
Rev        43.166667     6
Sir        49.000000     1

In [25]:
df.groupby("new_title")["Age"].transform("mean")

0      32.368090
1      35.898148
2      21.773973
3      35.898148
4      32.368090
         ...
886    43.166667
887    21.773973
888    21.773973
889    32.368090
890    32.368090
Name: Age, Length: 891, dtype: float64

In [28]:
df[["new_title","Age"]]

    new_title   Age
0          Mr  22.0
1         Mrs  38.0
2        Miss  26.0
3         Mrs  35.0
4          Mr  35.0
..        ...   ...
886       Rev  27.0
887      Miss  19.0
888      Miss   NaN
889        Mr  26.0
890        Mr  32.0

[891 rows x 2 columns]